In [1]:
import pandas as pd

In [5]:
df = pd.read_excel('../Datasets/Salaries.xlsx')

In [6]:
#List the first 5 records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [7]:
#list the last 5 records
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [8]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [10]:
df['salary'].dtype

dtype('int64')

In [11]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [12]:
#Number of dimensions
df.ndim

2

In [13]:
#Number of elements
df.size

468

In [14]:
#Shape attribute
df.shape

(78, 6)

In [15]:
78*6

468

In [16]:
#Number of rows
df.shape[0]

78

In [17]:
#Number of Columns
df.shape[1]

6

In [18]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [19]:
#Descriptive statistics for numeric columns
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [ ]:
df[['phd', 'service', 'salary']].max()

In [ ]:
#Mean of the first 50 records
df.head(50).mean()

In [ ]:
#Basic Statistics for the salary column
df['salary'].describe()

In [ ]:
#how many values in the salary column (use count method);
df['salary'].count()

In [ ]:
#Mean Salary
df['salary'].mean()

In [ ]:
df_rank= df.groupby(['rank'], sort = 'False')
df_rank.mean()

In [ ]:
df.describe()

In [ ]:
df.isnull().sum()

In [ ]:
df.drop_duplicates(inplace = True)

In [ ]:
df.shape

In [ ]:
df.to_excel('Salaries-PreProcessed.xlsx')

In [9]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800